# Silk Email Parser

## 📝 Описание

Специализированный парсер для извлечения и обработки email-адресов из специфичных источников, связанных с проектом Silk/Redage.

## 🎯 Назначение

- Парсинг email из специфичных форматов данных
- Обработка и очистка списков
- Рандомизация данных
- Подготовка выходных файлов

## 📋 Файлы

- **`scr.py`** - Основной скрипт парсера
- **`redage.txt`** - Исходные данные
- **`redage_randomize.txt`** - Рандомизированные данные
- **`temp.txt`** - Временный файл обработки
- **`temp1.txt`** - Промежуточные результаты
- **`temp1_cleaned.txt`** - Очищенные результаты

## 🔧 Требования

```bash
pip install requests
```

## 🚀 Использование

```bash
python scr.py
```

## 📊 Как работает

1. **Чтение данных** - Загружает данные из `redage.txt`
2. **Парсинг** - Извлекает email и связанные данные
3. **Очистка** - Удаляет дубликаты и невалидные записи
4. **Рандомизация** - Перемешивает данные (опционально)
5. **Сохранение** - Записывает результаты в выходные файлы

## 📂 Входные данные

### redage.txt
Исходный файл с данными в специфичном формате.

### redage_randomize.txt
Версия с перемешанными данными для анонимизации.

## 📂 Выходные данные

### temp1.txt
Промежуточные результаты парсинга.

### temp1_cleaned.txt
Финальный очищенный список email:
```
email1@example.com
email2@gmail.com
email3@mail.ru
```

## 🔍 Обработка данных

### Очистка
- Удаление дубликатов
- Валидация email
- Форматирование

### Рандомизация
```python
import random
random.shuffle(email_list)
```

## 💡 Применение

- Обработка дампов
- Подготовка списков рассылки
- Анализ данных
- Миграция между системами

## 🐛 Решение проблем

### Проблема: Пустой результат
**Решение:** Проверьте формат входных данных

### Проблема: Некорректная кодировка
**Решение:** 
```python
with open('file.txt', 'r', encoding='utf-8') as f:
    data = f.read()
```

### Проблема: Дубликаты не удаляются
**Решение:**
```python
unique_emails = list(set(emails))
```

## 💡 Улучшения

### 1. Валидация email
```python
import re
def is_valid_email(email):
    pattern = r'^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$'
    return re.match(pattern, email) is not None
```

### 2. Статистика
```python
print(f"Всего записей: {total}")
print(f"Уникальных email: {unique}")
print(f"Дубликатов удалено: {duplicates}")
```

### 3. Прогресс-бар
```python
from tqdm import tqdm
for line in tqdm(file):
    process(line)
```

## 🔒 Безопасность

⚠️ **Работа с чувствительными данными:**
- Не храните пароли в открытом виде
- Удаляйте временные файлы после обработки
- Используйте .gitignore для приватных данных
- Соблюдайте GDPR и местное законодательство

### Очистка после работы
```bash
# Удалить временные файлы
rm temp.txt temp1.txt

# Или на Windows
del temp.txt temp1.txt
```

## 📊 Формат данных

Скрипт работает со специфичным форматом данных проекта Silk/Redage. Для адаптации под другие форматы необходимо модифицировать парсинг.

## 🔄 Адаптация под другие проекты

```python
# Замените логику парсинга под ваш формат
def parse_custom_format(line):
    # Ваша логика извлечения email
    return email
```

## 📝 Пример работы

```bash
python scr.py

Чтение redage.txt...
Парсинг данных...
Очистка дубликатов...
Сохранение результатов...
Готово! Обработано: 15000 записей
Уникальных: 12500
```

## 🔗 Связанные инструменты

- **domain_email_scraper/** - Скрейпинг email по домену
- **email_extractor/** - Извлечение email с сайтов
- **gta5rp_email_extractor/** - Похожий специализированный парсер

---

**Автор:** Jazis  
**Версия:** 1.0  
**Проект:** Silk/Redage  
**Последнее обновление:** 16 декабря 2025
