# Search Engine Parser (Bing Parser)

## 📝 Описание

Парсер для извлечения ссылок из результатов поиска Ask.com (ранее работал с Bing). Использует дорки (специальные поисковые запросы) для целенаправленного поиска уязвимых или интересующих страниц.

## 🎯 Назначение

- Парсинг результатов поисковой системы
- Работа с Google Dorks
- Автоматизация поиска уязвимостей
- Сбор URL по заданным критериям
- Пагинация результатов (до 5 страниц)

## ⚠️ ВАЖНОЕ ПРЕДУПРЕЖДЕНИЕ

**Только для легальных целей:**
- ✅ Тестирование безопасности собственных систем
- ✅ Исследование с разрешения
- ✅ Образовательные цели
- ❌ НЕ для поиска уязвимостей на чужих сайтах без разрешения
- ❌ НЕ для взлома
- ❌ Соблюдайте rate limits поисковой системы

## 📋 Файлы

### Основные скрипты
- **`parse.py`** - Главный парсер Ask.com
- **`another_parser.py`** - Альтернативная версия
- **`new_parser.py`** - Обновленная версия
- **`Untitled-1.py`** - Экспериментальная версия

### Входные данные
- **`in.txt`** - Файл с дорками (один запрос на строку)
- **`dorks.txt`** - Дополнительный список дорков
- **`_dorks.txt`** - Специальные дорки
- **`may_sql.txt`** - SQL-специфичные дорки

### Выходные данные
- **`output.txt`** - Найденные URL

### Временные файлы
- **`temp`** - Временное хранилище

### Подпапки
- **`file_parser/`** - Вспомогательный парсер для обработки файлов

## 🔧 Требования

```bash
pip install requests
pip install beautifulsoup4
pip install lxml
```

## 🚀 Использование

### Подготовка дорков

Создайте файл `in.txt` с поисковыми запросами:
```
inurl:"admin.php" intext:"Login"
inurl:"cart.php" intext:"Warning"
site:example.com filetype:sql
intext:"Index of /" "password.txt"
```

### Запуск

```bash
python parse.py
```

Скрипт автоматически:
1. Прочитает дорки из `in.txt`
2. Для каждого дорка выполнит поиск
3. Обработает до 5 страниц результатов
4. Сохранит все URL в `output.txt`

## 📊 Как работает

### 1. Чтение дорков
```python
fil = "D:\\#projects_py\\bing_parser\\in.txt"
with open(fil, 'r') as file:
    for line in file:
        zapros = line.replace("\n", "")
        start(zapros)
```

### 2. Формирование запроса
```python
params = {
    'q': str(qw),
    'o': str(i),  # номер страницы
}
```

### 3. Парсинг результатов
```python
response = requests.get('https://www.ask.com/web', 
                       params=params, 
                       cookies=cookies, 
                       headers=headers)
```

### 4. Извлечение ссылок
Из JSON ответа извлекаются ссылки на найденные страницы.

## 📈 Пример работы

### Входные данные (in.txt)
```
inurl:admin.php
site:example.com login
intext:"sql error"
```

### Процесс выполнения
```
Обработка дорка: inurl:admin.php
Страница 1: https://www.ask.com/web?q=inurl%3Aadmin.php&o=0
Найдено 10 ссылок
Страница 2: https://www.ask.com/web?q=inurl%3Aadmin.php&o=1
Найдено 10 ссылок
...
```

### Выходные данные (output.txt)
```
http://site1.com/admin.php
http://site2.com/administrator/admin.php
http://site3.com/panel/admin.php
```

## 🔍 Популярные дорки

### SQL Injection
```
inurl:"id=" & intext:"mysql_fetch_array()"
inurl:".php?id=" intext:"You have an error in your SQL syntax"
```

### Login Pages
```
inurl:admin.php
inurl:login.php
intext:"Admin Login"
```

### Directory Listing
```
intitle:"Index of /" "password.txt"
intitle:"Index of /" "database.sql"
```

### Configuration Files
```
filetype:env "DB_PASSWORD"
filetype:config "password"
```

## 💡 Особенности

### Обработка cookies
```python
cookies = {
    'iac_o': '0',
    'rtb': '20000',
    # ... другие cookies
}
```

### User-Agent
```python
headers = {
    'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) ...',
    'sec-gpc': '1',
}
```

### Пагинация
Обрабатывает до 5 страниц результатов для каждого дорка.

## 🐛 Решение проблем

### Проблема: "Blocked by search engine"
**Решение:**
- Добавьте задержки между запросами
- Используйте прокси
- Смените User-Agent
- Уменьшите количество запросов

### Проблема: Пустые результаты
**Решение:**
- Проверьте формат дорков
- Обновите селекторы (структура Ask.com могла измениться)
- Проверьте cookies

### Проблема: JSON parsing error
**Решение:**
- Ask.com изменил формат ответа
- Обновите логику парсинга

## 💡 Улучшения

### 1. Добавить задержки
```python
import time
time.sleep(random.uniform(2, 5))  # Случайная задержка 2-5 сек
```

### 2. Прокси поддержка
```python
proxies = {
    'http': 'http://proxy:port',
    'https': 'https://proxy:port',
}
requests.get(url, proxies=proxies)
```

### 3. Логирование
```python
import logging
logging.basicConfig(level=logging.INFO)
logger.info(f"Обработка дорка: {dork}")
```

### 4. Обработка ошибок
```python
try:
    response = requests.get(url, timeout=10)
    response.raise_for_status()
except requests.exceptions.RequestException as e:
    logger.error(f"Ошибка: {e}")
```

## 🔄 Альтернативные поисковые системы

### Google Custom Search API
```python
import googleapiclient.discovery
service = googleapiclient.discovery.build("customsearch", "v1", 
                                         developerKey=api_key)
```

### DuckDuckGo
```python
from duckduckgo_search import ddg
results = ddg(query, max_results=10)
```

## 📝 Создание эффективных дорков

### Операторы поиска
- `site:` - Поиск на конкретном домене
- `inurl:` - Слово в URL
- `intext:` - Слово в тексте страницы
- `intitle:` - Слово в заголовке
- `filetype:` - Тип файла
- `ext:` - Расширение файла

### Комбинации
```
site:example.com inurl:admin
intitle:"Index of" "parent directory"
filetype:pdf "confidential"
```

## 📊 Статистика

Добавьте подсчет:
```python
total_links = 0
total_dorks = 0
# После обработки
print(f"Обработано дорков: {total_dorks}")
print(f"Найдено ссылок: {total_links}")
```

## 🔒 Безопасность и этика

### ✅ Ответственное использование:
1. Тестируйте только свои системы
2. Получайте письменное разрешение
3. Соблюдайте rate limits
4. Не перегружайте серверы
5. Документируйте находки

### ❌ Запрещено:
1. Несанкционированное сканирование
2. Эксплуатация найденных уязвимостей
3. Распространение конфиденциальных данных

## 🔗 Связанные инструменты

- **sql_dork_scanner/** - Специализированный SQL dork сканер
- **basic_web_crawler/** - Для детального сканирования найденных сайтов

## 📚 Дополнительные ресурсы

- [Google Hacking Database](https://www.exploit-db.com/google-hacking-database)
- [Dorking Guide](https://gist.github.com/sundowndev/283efaddbcf896ab405488330d1bbc06)

---

**Автор:** Jazis  
**Версия:** 1.0  
**Целевая система:** Ask.com  
**Python:** 2.7 (рекомендуется обновление до 3.x)  
**Статус:** Только для легальных целей  
**Последнее обновление:** 16 декабря 2025
